public_html/hw5.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hw5</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="hw5"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-23 22:24:24 CDT"/>
<meta name="author" content="Neil Best"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">hw5</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 CSPP 53001: Assignment 5</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Project is due by 11:59pm on Friday, November 16, 2012</a></li>
<li><a href="#sec-1-2">1.2 Steps 4 and 5 of Your TBP App</a></li>
<li><a href="#sec-1-3">1.3 There is no Gradiance Problem Set this week</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CSPP 53001: Assignment 5</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Project is due by 11:59pm on Friday, November 16, 2012</h4>
<div class="outline-text-4" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> Steps 4 and 5 of Your TBP App</h4>
<div class="outline-text-4" id="text-1-2">


<p>
The fourth part of your TBP project is to generate some more data and
populate your MySQL database with it. The fifth part is to design and
develop several join and aggregation queries on this larger database.
</p>
<p>
You also have the <b>optional</b> choice to redesign your database based on
the feedback you have received from the instructor and the TAs and your
experience developing the TBP App so far. If you do choose to redesign
your database in a significant way, please, include your new ER diagram,
named TBP_ERD_v2.??? with your submission. Note that adding or
deleting several attributes or adding a few new relationships <b>is not</b> a
significant redesign. If you do choose these option, please, make sure
that the relations in your database correspond (i.e. have the same
names) to the entity sets and relationships in your ER diagram.
</p>
<p>
Develop a larger amount of data for your database and load it into your
relations using the SQL load command. The data you generate and load
should be on the order of:
</p>
<ul>
<li>At least two relations with thousands of tuples
</li>
<li>At least one additional relation with hundreds of tuples
</li>
</ul>


<p>
To create more data for your relations, you can write a program in any
programming language you like. The program should create large files
consisting of records in an <b>ASCII text-only</b> format acceptable to the
MySQL bulk loader. Then you should load the data into your TBP
relations. If you are using real data, your program will need to
transform the data into files of records conforming to your TBP schema.
Otherwise you will write a program to fabricate data: your program will
generate either random or nonrandom (e.g., sequential) records
conforming to your schema. Note that it is acceptable for your data
values to be meaningless (i.e. random sequence of characters instead of
actual names).
</p>
<p>
If the semantics of your schema includes relations that are expected to
be relatively small (e.g., states in the US), it is fine to use some
small relations, but please ensure that you have relations of the sizes
prescribed above as well. When writing a program to fabricate data,
there are two important points to keep in mind:
</p>
<ul>
<li>Be sure not to generate duplicate values for your key attributes.
</li>
<li>Your TBP certainly includes relations that are expected to join with
   each other. For example, if the key of the Users relation is
   username, then it is expected to join with the username_leader and
   username_follower attributes of the Follows relation. In generating
   data, be sure to generate values that actually do join &ndash; otherwise
   all of your interesting queries will have empty results! One way to
   guarantee joinability is to generate the values in one relation
   (corresponding to an entity set in your E/R diagram), then use the
   generated values to select joining values for the other relation
   (corresponding to a relationship in your E/R diagram). For example,
   you could generate usernames first (either sequentially or randomly),
   then use these usernames to fill in the username_leader and
   username_follower values in the Follows relation.
</li>
</ul>


<p>
You will need to submit your new <code>create_db_large.sql</code> and
<code>populate_db_large.sql</code> scripts along with <b>all data files</b> referenced
in your <code>populate_db_large.sql</code> script.
</p>
<p>
To demonstrate the size of your new relations, please, generate a script
file called <code>count.sql</code> that finds the number of tuples in every one of
your relations.
</p>
<p>
<b>Extra credit:</b> Develop a single query that returns the name of every
table along with its size. For example, if you had only three tables:
Users, Tweets, and Follows and their sizes were 10000, 50000, and
100000, the result of your single query should look like this:
</p>



<pre class="example">+------------+------------+
| table_name | table_size |
+------------+------------+
| Users      |      10000 |
+------------+------------+
| Tweets     |      50000 |
+------------+------------+
| Follows    |     100000 |
+------------+------------+
</pre>


<p>
Develop and test at least ten SQL queries using the JOIN syntax
discussed in class. At least five of your queries should involve
aggregation. To receive full credit, you should use all JOIN variations
discussed in class (ON, USING, NATURAL, OUTER) and aggregation with and
without GROUP BY clause. Please, generate a script file called
<code>query5.sql</code> with all of your join and aggregation queries. *Your
queries must not produce empty results and also must complete in a
reasonable amount of time (a few minutes).* If any of your queries takes
a long time to complete, consider modifying it by adding more conditions
that limit the size of the intermediate results or final result. For
example, if your query finds all pairs of users that follow at least one
user in common:
</p>



<pre class="example">SELECT DISTINCT F_1.username_follower AS user1, 
F_2.username_follower AS user2
FROM Follows F_1 JOIN Follows F_2
USING (username_leader)
WHERE F_1.username_follower &lt;&gt; F_2.username_follower;
</pre>


<p>
and it takes 30 minutes or more to produces millions of results,
consider adding some conditions that limit the users from F_1 and F_2.
For example, you can only consider usernames starting with the letters
"a" and "b":
</p>



<pre class="example">SELECT DISTINCT F_1.username_follower AS user1, 
F_2.username_follower AS user2
FROM Follows F_1 JOIN Follows F_2
ON (F_1.username_leader = F_2.username_leader
AND F_1.username_follower LIKE "a%"
AND F_2.username_follower LIKE "b%")
WHERE F_1.username_follower &lt;&gt; F_2.username_follower;
</pre>


<p>
Note that you <b>do need to submit the scripts that populates your large database as well as the corresponding data files</b>
</p>
<p>
You will submit your homework using the <code>hwsubmit</code> command. Please,
create a new directory called hw5_&lt;your_username&gt;, e.g. hw5_evtimov,
and move there all of the relevant scripts <b>and all data files</b>. For
this assignment, there should be the four scripts:
<code>create_db_large.sql</code>, <code>populate_db_large.sql</code>, <code>count.sql</code> and
<code>query5.sql</code>, all the large data files and, if you have chosen to
redesign your database, your new ER diagram TBP_ERD_v2.???. Then, you
can submit your work by typing (&lt;path_to&gt; is the directory path to your
hw5 directory).
</p>
<p>
<code>hwsubmit cspp53001 &lt;path_to&gt;/hw5_&lt;your_username&gt;</code>
</p>
<p>
<b>Please make sure that all of the relevant files and no others are in that directory.</b>
</p>

<hr/>

</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3"><span class="section-number-4">1.3</span> There is no Gradiance Problem Set this week</h4>
<div class="outline-text-4" id="text-1-3">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-23 22:24:24 CDT</p>
<p class="author">Author: Neil Best</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
